GopalSaraf/Practicals/PSDL/include/proc/pic16f15323.h
extern volatile PWM5DCHbits_t PWM5DCHbits __at(0x31D);
// bitfield macros
#define _PWM5DCH_DC_POSN                                    0x0
#define _PWM5DCH_DC_POSITION                                0x0
#define _PWM5DCH_DC_SIZE                                    0x8
#define _PWM5DCH_DC_LENGTH                                  0x8
#define _PWM5DCH_DC_MASK                                    0xFF
#define _PWM5DCH_DC2_POSN                                   0x0
#define _PWM5DCH_DC2_POSITION                               0x0
#define _PWM5DCH_DC2_SIZE                                   0x1
#define _PWM5DCH_DC2_LENGTH                                 0x1
#define _PWM5DCH_DC2_MASK                                   0x1
#define _PWM5DCH_DC3_POSN                                   0x1
#define _PWM5DCH_DC3_POSITION                               0x1
#define _PWM5DCH_DC3_SIZE                                   0x1
#define _PWM5DCH_DC3_LENGTH                                 0x1
#define _PWM5DCH_DC3_MASK                                   0x2
#define _PWM5DCH_DC4_POSN                                   0x2
#define _PWM5DCH_DC4_POSITION                               0x2
#define _PWM5DCH_DC4_SIZE                                   0x1
#define _PWM5DCH_DC4_LENGTH                                 0x1
#define _PWM5DCH_DC4_MASK                                   0x4
#define _PWM5DCH_DC5_POSN                                   0x3
#define _PWM5DCH_DC5_POSITION                               0x3
#define _PWM5DCH_DC5_SIZE                                   0x1
#define _PWM5DCH_DC5_LENGTH                                 0x1
#define _PWM5DCH_DC5_MASK                                   0x8
#define _PWM5DCH_DC6_POSN                                   0x4
#define _PWM5DCH_DC6_POSITION                               0x4
#define _PWM5DCH_DC6_SIZE                                   0x1
#define _PWM5DCH_DC6_LENGTH                                 0x1
#define _PWM5DCH_DC6_MASK                                   0x10
#define _PWM5DCH_DC7_POSN                                   0x5
#define _PWM5DCH_DC7_POSITION                               0x5
#define _PWM5DCH_DC7_SIZE                                   0x1
#define _PWM5DCH_DC7_LENGTH                                 0x1
#define _PWM5DCH_DC7_MASK                                   0x20
#define _PWM5DCH_DC8_POSN                                   0x6
#define _PWM5DCH_DC8_POSITION                               0x6
#define _PWM5DCH_DC8_SIZE                                   0x1
#define _PWM5DCH_DC8_LENGTH                                 0x1
#define _PWM5DCH_DC8_MASK                                   0x40
#define _PWM5DCH_DC9_POSN                                   0x7
#define _PWM5DCH_DC9_POSITION                               0x7
#define _PWM5DCH_DC9_SIZE                                   0x1
#define _PWM5DCH_DC9_LENGTH                                 0x1
#define _PWM5DCH_DC9_MASK                                   0x80
#define _PWM5DCH_PWM5DC2_POSN                               0x0
#define _PWM5DCH_PWM5DC2_POSITION                           0x0
#define _PWM5DCH_PWM5DC2_SIZE                               0x1
#define _PWM5DCH_PWM5DC2_LENGTH                             0x1
#define _PWM5DCH_PWM5DC2_MASK                               0x1
#define _PWM5DCH_PWM5DC3_POSN                               0x1
#define _PWM5DCH_PWM5DC3_POSITION                           0x1
#define _PWM5DCH_PWM5DC3_SIZE                               0x1
#define _PWM5DCH_PWM5DC3_LENGTH                             0x1
#define _PWM5DCH_PWM5DC3_MASK                               0x2
#define _PWM5DCH_PWM5DC4_POSN                               0x2
#define _PWM5DCH_PWM5DC4_POSITION                           0x2
#define _PWM5DCH_PWM5DC4_SIZE                               0x1
#define _PWM5DCH_PWM5DC4_LENGTH                             0x1
#define _PWM5DCH_PWM5DC4_MASK                               0x4
#define _PWM5DCH_PWM5DC5_POSN                               0x3
#define _PWM5DCH_PWM5DC5_POSITION                           0x3
#define _PWM5DCH_PWM5DC5_SIZE                               0x1
#define _PWM5DCH_PWM5DC5_LENGTH                             0x1
#define _PWM5DCH_PWM5DC5_MASK                               0x8
#define _PWM5DCH_PWM5DC6_POSN                               0x4
#define _PWM5DCH_PWM5DC6_POSITION                           0x4
#define _PWM5DCH_PWM5DC6_SIZE                               0x1
#define _PWM5DCH_PWM5DC6_LENGTH                             0x1
#define _PWM5DCH_PWM5DC6_MASK                               0x10
#define _PWM5DCH_PWM5DC7_POSN                               0x5
#define _PWM5DCH_PWM5DC7_POSITION                           0x5
#define _PWM5DCH_PWM5DC7_SIZE                               0x1
#define _PWM5DCH_PWM5DC7_LENGTH                             0x1
#define _PWM5DCH_PWM5DC7_MASK                               0x20
#define _PWM5DCH_PWM5DC8_POSN                               0x6
#define _PWM5DCH_PWM5DC8_POSITION                           0x6
#define _PWM5DCH_PWM5DC8_SIZE                               0x1
#define _PWM5DCH_PWM5DC8_LENGTH                             0x1
#define _PWM5DCH_PWM5DC8_MASK                               0x40
#define _PWM5DCH_PWM5DC9_POSN                               0x7
#define _PWM5DCH_PWM5DC9_POSITION                           0x7
#define _PWM5DCH_PWM5DC9_SIZE                               0x1
#define _PWM5DCH_PWM5DC9_LENGTH                             0x1
#define _PWM5DCH_PWM5DC9_MASK                               0x80
#define _PWM5DCH_PWMPW2_POSN                                0x0
#define _PWM5DCH_PWMPW2_POSITION                            0x0
#define _PWM5DCH_PWMPW2_SIZE                                0x1
#define _PWM5DCH_PWMPW2_LENGTH                              0x1
#define _PWM5DCH_PWMPW2_MASK                                0x1
#define _PWM5DCH_PWMPW3_POSN                                0x1
#define _PWM5DCH_PWMPW3_POSITION                            0x1
#define _PWM5DCH_PWMPW3_SIZE                                0x1
#define _PWM5DCH_PWMPW3_LENGTH                              0x1
#define _PWM5DCH_PWMPW3_MASK                                0x2
#define _PWM5DCH_PWMPW4_POSN                                0x2
#define _PWM5DCH_PWMPW4_POSITION                            0x2
#define _PWM5DCH_PWMPW4_SIZE                                0x1
#define _PWM5DCH_PWMPW4_LENGTH                              0x1
#define _PWM5DCH_PWMPW4_MASK                                0x4
#define _PWM5DCH_PWMPW5_POSN                                0x3
#define _PWM5DCH_PWMPW5_POSITION                            0x3
#define _PWM5DCH_PWMPW5_SIZE                                0x1
#define _PWM5DCH_PWMPW5_LENGTH                              0x1
#define _PWM5DCH_PWMPW5_MASK                                0x8
#define _PWM5DCH_PWMPW6_POSN                                0x4
#define _PWM5DCH_PWMPW6_POSITION                            0x4
#define _PWM5DCH_PWMPW6_SIZE                                0x1
#define _PWM5DCH_PWMPW6_LENGTH                              0x1
#define _PWM5DCH_PWMPW6_MASK                                0x10
#define _PWM5DCH_PWMPW7_POSN                                0x5
#define _PWM5DCH_PWMPW7_POSITION                            0x5
#define _PWM5DCH_PWMPW7_SIZE                                0x1
#define _PWM5DCH_PWMPW7_LENGTH                              0x1
#define _PWM5DCH_PWMPW7_MASK                                0x20
#define _PWM5DCH_PWMPW8_POSN                                0x6
#define _PWM5DCH_PWMPW8_POSITION                            0x6
#define _PWM5DCH_PWMPW8_SIZE                                0x1
#define _PWM5DCH_PWMPW8_LENGTH                              0x1
#define _PWM5DCH_PWMPW8_MASK                                0x40
#define _PWM5DCH_PWMPW9_POSN                                0x7
#define _PWM5DCH_PWMPW9_POSITION                            0x7
#define _PWM5DCH_PWMPW9_SIZE                                0x1
#define _PWM5DCH_PWMPW9_LENGTH                              0x1
#define _PWM5DCH_PWMPW9_MASK                                0x80

// Register: PWM5CON
#define PWM5CON PWM5CON
extern volatile unsigned char           PWM5CON             __at(0x31E);
#ifndef _LIB_BUILD
asm("PWM5CON equ 031Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned POL                    :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned                        :4;
        unsigned PWM5POL                :1;
        unsigned PWM5OUT                :1;
        unsigned                        :1;
        unsigned PWM5EN                 :1;
    };
} PWM5CONbits_t;
extern volatile PWM5CONbits_t PWM5CONbits __at(0x31E);
// bitfield macros
#define _PWM5CON_POL_POSN                                   0x4
#define _PWM5CON_POL_POSITION                               0x4
#define _PWM5CON_POL_SIZE                                   0x1
#define _PWM5CON_POL_LENGTH                                 0x1
#define _PWM5CON_POL_MASK                                   0x10
#define _PWM5CON_OUT_POSN                                   0x5
#define _PWM5CON_OUT_POSITION                               0x5
#define _PWM5CON_OUT_SIZE                                   0x1
#define _PWM5CON_OUT_LENGTH                                 0x1
#define _PWM5CON_OUT_MASK                                   0x20
#define _PWM5CON_EN_POSN                                    0x7
#define _PWM5CON_EN_POSITION                                0x7
#define _PWM5CON_EN_SIZE                                    0x1
#define _PWM5CON_EN_LENGTH                                  0x1
#define _PWM5CON_EN_MASK                                    0x80
#define _PWM5CON_PWM5POL_POSN                               0x4
#define _PWM5CON_PWM5POL_POSITION                           0x4
#define _PWM5CON_PWM5POL_SIZE                               0x1
#define _PWM5CON_PWM5POL_LENGTH                             0x1
#define _PWM5CON_PWM5POL_MASK                               0x10
#define _PWM5CON_PWM5OUT_POSN                               0x5
#define _PWM5CON_PWM5OUT_POSITION                           0x5
#define _PWM5CON_PWM5OUT_SIZE                               0x1
#define _PWM5CON_PWM5OUT_LENGTH                             0x1
#define _PWM5CON_PWM5OUT_MASK                               0x20
#define _PWM5CON_PWM5EN_POSN                                0x7
#define _PWM5CON_PWM5EN_POSITION                            0x7
#define _PWM5CON_PWM5EN_SIZE                                0x1
#define _PWM5CON_PWM5EN_LENGTH                              0x1
#define _PWM5CON_PWM5EN_MASK                                0x80

// Register: PWM6DC
#define PWM6DC PWM6DC
extern volatile unsigned short          PWM6DC              __at(0x38C);
#ifndef _LIB_BUILD
asm("PWM6DC equ 038Ch");
#endif

// Register: PWM6DCL
#define PWM6DCL PWM6DCL
extern volatile unsigned char           PWM6DCL             __at(0x38C);
#ifndef _LIB_BUILD
asm("PWM6DCL equ 038Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :6;
        unsigned DC                     :2;
    };
    struct {
        unsigned                        :6;
        unsigned DC0                    :1;
        unsigned DC1                    :1;
    };
    struct {
        unsigned                        :6;
        unsigned PWM6DC0                :1;
        unsigned PWM6DC1                :1;
    };
    struct {
        unsigned                        :6;
        unsigned PWMPW0                 :1;
        unsigned PWMPW1                 :1;
    };
} PWM6DCLbits_t;
extern volatile PWM6DCLbits_t PWM6DCLbits __at(0x38C);
// bitfield macros
#define _PWM6DCL_DC_POSN                                    0x6
#define _PWM6DCL_DC_POSITION                                0x6
#define _PWM6DCL_DC_SIZE                                    0x2
#define _PWM6DCL_DC_LENGTH                                  0x2
#define _PWM6DCL_DC_MASK                                    0xC0
#define _PWM6DCL_DC0_POSN                                   0x6
#define _PWM6DCL_DC0_POSITION                               0x6
#define _PWM6DCL_DC0_SIZE                                   0x1
#define _PWM6DCL_DC0_LENGTH                                 0x1
#define _PWM6DCL_DC0_MASK                                   0x40
#define _PWM6DCL_DC1_POSN                                   0x7
#define _PWM6DCL_DC1_POSITION                               0x7
#define _PWM6DCL_DC1_SIZE                                   0x1
#define _PWM6DCL_DC1_LENGTH                                 0x1
#define _PWM6DCL_DC1_MASK                                   0x80
#define _PWM6DCL_PWM6DC0_POSN                               0x6
#define _PWM6DCL_PWM6DC0_POSITION                           0x6
#define _PWM6DCL_PWM6DC0_SIZE                               0x1
#define _PWM6DCL_PWM6DC0_LENGTH                             0x1
#define _PWM6DCL_PWM6DC0_MASK                               0x40
#define _PWM6DCL_PWM6DC1_POSN                               0x7
#define _PWM6DCL_PWM6DC1_POSITION                           0x7
#define _PWM6DCL_PWM6DC1_SIZE                               0x1
#define _PWM6DCL_PWM6DC1_LENGTH                             0x1
#define _PWM6DCL_PWM6DC1_MASK                               0x80
#define _PWM6DCL_PWMPW0_POSN                                0x6
#define _PWM6DCL_PWMPW0_POSITION                            0x6
#define _PWM6DCL_PWMPW0_SIZE                                0x1
#define _PWM6DCL_PWMPW0_LENGTH                              0x1
#define _PWM6DCL_PWMPW0_MASK                                0x40
#define _PWM6DCL_PWMPW1_POSN                                0x7
#define _PWM6DCL_PWMPW1_POSITION                            0x7
#define _PWM6DCL_PWMPW1_SIZE                                0x1
#define _PWM6DCL_PWMPW1_LENGTH                              0x1
#define _PWM6DCL_PWMPW1_MASK                                0x80

// Register: PWM6DCH
#define PWM6DCH PWM6DCH
extern volatile unsigned char           PWM6DCH             __at(0x38D);
#ifndef _LIB_BUILD
asm("PWM6DCH equ 038Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DC                     :8;
    };
    struct {
        unsigned DC2                    :1;
        unsigned DC3                    :1;
        unsigned DC4                    :1;
        unsigned DC5                    :1;
        unsigned DC6                    :1;
        unsigned DC7                    :1;
        unsigned DC8                    :1;
        unsigned DC9                    :1;
    };
    struct {
        unsigned PWM6DC2                :1;
        unsigned PWM6DC3                :1;
        unsigned PWM6DC4                :1;
        unsigned PWM6DC5                :1;
        unsigned PWM6DC6                :1;
        unsigned PWM6DC7                :1;
        unsigned PWM6DC8                :1;
        unsigned PWM6DC9                :1;
    };
    struct {
        unsigned PWMPW2                 :1;
        unsigned PWMPW3                 :1;
        unsigned PWMPW4                 :1;
        unsigned PWMPW5                 :1;
        unsigned PWMPW6                 :1;
        unsigned PWMPW7                 :1;
        unsigned PWMPW8                 :1;
        unsigned PWMPW9                 :1;
    };
} PWM6DCHbits_t;
